driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/RepeatUntilWhileTest25/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rep="http://localhost/RepeatUntilBPEL/RepeatUntilWhile">
  <soapenv:Body>
    <rep:part1>TestWhile</rep:part1>
    <rep:part2>2</rep:part2>
    <rep:part3>7</rep:part3>
  </soapenv:Body>
</soapenv:Envelope>